In [205]:
import pandas as pd
import numpy as np

In [206]:
url = 'https://raw.githubusercontent.com/Agablue-red/SalaryPrediction/main/dataset/Salary_Data.csv'
df = pd.read_csv(url)

In [207]:
df.head()

,Age,Gender,Education Level,Job Title,Years of Experience,Salary
0,32.0,Male,Bachelor's,Software Engineer,5.0,90000.0
1,28.0,Female,Master's,Data Analyst,3.0,65000.0
2,45.0,Male,PhD,Senior Manager,15.0,150000.0
3,36.0,Female,Bachelor's,Sales Associate,7.0,60000.0
4,52.0,Male,Master's,Director,20.0,200000.0

In [208]:
# remove special character
df.columns = df.columns.str.replace(' ', '')

In [209]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 6704 entries, 0 to 6703
Data columns (total 6 columns):
 #   Column             Non-Null Count  Dtype
---  ------             --------------  -----
 0   Age                6702 non-null   float64
 1   Gender             6702 non-null   object
 2   EducationLevel     6701 non-null   object
 3   JobTitle           6702 non-null   object
 4   YearsofExperience  6701 non-null   float64
 5   Salary             6699 non-null   float64
dtypes: float64(3), object(3)
memory usage: 314.4+ KB

Unique values

In [210]:
df.nunique()

Age                   41
Gender                 3
EducationLevel         7
JobTitle             193
YearsofExperience     37
Salary               444
dtype: int64

In [211]:
print('Amount of unique values for', df['Gender'].unique())
print('Amount of unique values for', df['EducationLevel'].unique())

Amount of unique values for ['Male' 'Female' nan 'Other']
Amount of unique values for ["Bachelor's" "Master's" 'PhD' nan "Bachelor's Degree" "Master's Degree"
 'High School' 'phD']

In [212]:
df['EducationLevel'] = df['EducationLevel'].str.replace(" Degree", "")

In [213]:
for column in df[['Gender','EducationLevel']]:
    if df[column].dtype == object:
        print(df[column].value_counts())

Male      3674
Female    3014
Other       14
Name: Gender, dtype: int64
Bachelor's     3023
Master's       1861
PhD            1368
High School     448
phD               1
Name: EducationLevel, dtype: int64

Duplicate

In [214]:
print('Orginal dataset consists of', df.shape[0], 'rows.\nDataset without duplicated values consists of', 
      df.shape[0] - df.duplicated().sum(), 'rows.\nI dropped', np.round(df.duplicated().sum() / df.shape[0] * 100,2), '% rows.')

Orginal dataset consists of 6704 rows.
Dataset without duplicated values consists of 1791 rows.
I dropped 73.28 % rows.

In [215]:
df.drop_duplicates(keep = 'first', inplace=True)

In [216]:
df.reset_index(inplace=True)
df.reset_index(drop=True)
df.drop('index', axis=1, inplace=True)

Missing data

In [217]:
df.isna().sum()

Age                  1
Gender               1
EducationLevel       2
JobTitle             1
YearsofExperience    2
Salary               4
dtype: int64

In [218]:
for column in df.columns:
    df_nan = df[df[column].isnull()]
    
df_nan

,Age,Gender,EducationLevel,JobTitle,YearsofExperience,Salary
172,NaN,NaN,NaN,NaN,NaN,NaN
1091,31.0,Male,Master's,Full Stack Engineer,8.0,NaN
1467,26.0,Female,Bachelor's,Social M,NaN,NaN
1723,36.0,Male,Bachelor's,Sales Director,6.0,NaN

In [219]:
df.dropna(how='all', inplace=True)

In [220]:
df.loc[(df['JobTitle'] == "Social M	"), :]

Empty DataFrame
Columns: [Age, Gender, EducationLevel, JobTitle, YearsofExperience, Salary]
Index: []

In [221]:
df.drop(df.index[1466], inplace=True)

In [222]:
row1091 = df.loc[(df['EducationLevel'] == "Master's") & (df['JobTitle'] == "Full Stack Engineer") & (df['YearsofExperience'] == 8.0), :] 
row1091

,Age,Gender,EducationLevel,JobTitle,YearsofExperience,Salary
481,36.0,Female,Master's,Full Stack Engineer,8.0,140000.0
578,36.0,Male,Master's,Full Stack Engineer,8.0,140000.0
676,35.0,Female,Master's,Full Stack Engineer,8.0,140000.0
840,33.0,Female,Master's,Full Stack Engineer,8.0,122581.0
899,32.0,Female,Master's,Full Stack Engineer,8.0,123781.0
990,33.0,Female,Master's,Full Stack Engineer,8.0,122970.0
1052,31.0,Male,Master's,Full Stack Engineer,8.0,120288.0
1091,31.0,Male,Master's,Full Stack Engineer,8.0,NaN

In [223]:
row1091['Salary'].mean()

129945.71428571429

In [224]:
# at- access a single value for a row/column label
df.at[1091,'Salary'] = np.round(row1091['Salary'].mean(),0)
df.at[1091,'Salary']

129946.0

In [225]:
row1723 = df.loc[(df['EducationLevel'] == "Bachelor's") & (df['JobTitle'] == "Sales Director") & (df['YearsofExperience'] == 6.0), :] 
row1723

       Age  Gender EducationLevel        JobTitle  YearsofExperience   Salary
1654  29.0    Male     Bachelor's  Sales Director                6.0  75000.0
1698  29.0  Female     Bachelor's  Sales Director                6.0  75000.0
1721  36.0    Male     Bachelor's  Sales Director                6.0  75000.0
1723  36.0    Male     Bachelor's  Sales Director                6.0      NaN

In [226]:
df.at[1723,'Salary'] = np.round(row1723['Salary'].mean(),0)
df.at[1723,'Salary']

75000.0

Dtype

In [227]:
for column in df.columns:
    if df[column].dtype == float:
        df[column] = pd.to_numeric(df[column], downcast='integer')

In [229]:
df.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 1789 entries, 0 to 1790
Data columns (total 6 columns):
 #   Column             Non-Null Count  Dtype
---  ------             --------------  -----
 0   Age                1789 non-null   int8
 1   Gender             1789 non-null   object
 2   EducationLevel     1788 non-null   object
 3   JobTitle           1789 non-null   object
 4   YearsofExperience  1789 non-null   float64
 5   Salary             1789 non-null   int32
dtypes: float64(1), int32(1), int8(1), object(3)
memory usage: 143.2+ KB